app/Models/GsbModel.php

    public function get_infos_utilisateur($login, $mdp)
    {
        return $this->db->table('info_user')
            ->select('idUtilisateur, nom, prenom, login, Role, date-derniere-modif-mdp')
            ->where('login', $login)
            ->where('mdp', $mdp)
            ->get()
            ->getRowArray();
---
SELECT `idUtilisateur`, `nom`, `prenom`, `login`, `Role`, `mdp`
FROM `info_user`
WHERE `login` = 'dandre'
AND `mdp` = 'oppg5'

    public function get_les_mois_disponibles($idVisiteur)
    {
        return $this->db->table('fichefrais')
            ->select('CONCAT(annee,mois) AS "anneemois", annee, mois')
            ->where('idVisiteur', $idVisiteur)
            ->orderBy('annee', 'DESC')
            ->orderBy('mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT CONCAT(annee, mois) AS "anneemois", `annee`, `mois`
FROM `fichefrais`
WHERE `idVisiteur` = 'a17'
ORDER BY `annee` DESC, `mois` DESC

    public function get_id_ficheFrais($idVisiteur, $annee, $mois)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat')
            ->where('fichefrais.idVisiteur', $idVisiteur)
            ->where('fichefrais.annee', $annee)
            ->where('fichefrais.mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`
FROM `fichefrais`
WHERE `fichefrais`.`idVisiteur` = 'a17'
AND `fichefrais`.`annee` = '2025'
AND `fichefrais`.`mois` = '8'

    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat, fichefrais.dateModif, fichefrais.nbJustificatifs, fichefrais.montantValide, etatfrais.libelle')
            ->join('etatfrais', 'fichefrais.idEtat = etatfrais.idetat')
            ->where('fichefrais.idFiche', $idFiche)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`, `fichefrais`.`dateModif`, `fichefrais`.`nbJustificatifs`, `fichefrais`.`montantValide`, `etatfrais`.`libelle`
FROM `fichefrais`
JOIN `etatfrais` ON `fichefrais`.`idEtat` = `etatfrais`.`idetat`
WHERE `fichefrais`.`idFiche` = '25'

    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '25'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC

    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '25'

    public function est_premier_frais_mois($idVisiteur, $annee, $mois)
    {
        $row = $this->db->table('fichefrais')
            ->select('count(*) AS nblignesfrais')
            ->where('idVisiteur', $idVisiteur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT count(*) AS nblignesfrais
FROM `fichefrais`
WHERE `idVisiteur` = 'a17'
AND `annee` = '2025'
AND `mois` = '11'

    public function creer_nouveau_frais_hors_forfait($idFiche, $libelle, $date, $montant)
    {
        $resultat = $this->db->table('lignefraishorsforfait')->insert([
            'idFiche' => $idFiche,
            'libelle' => $libelle,
            'dateFrais' => $date,
            'montant' => $montant
        ]);
---
INSERT INTO `lignefraishorsforfait` (`idFiche`, `libelle`, `dateFrais`, `montant`) VALUES ('5672', 'testvvheiufve', '2025-11-14', '12156465')